<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задачи по массивам и циклам</title>
</head>

<?php
/**
 * Created by PhpStorm.
 * User: Oleg
 * Date: 09.09.2016
 * Time: 21:43
 */
//5. Дан массив $arr с ключами 'Коля', 'Вася', 'Петя' с элементами '200', '300', '400'. С помощью
//цикла foreach выведите на экран столбец строк такого формата: 'Коля — зарплата 200 долларов.'.

$arr = array(
    'Коля' => '200',
    'Вася' => '300',
    'Петя' => '400',
);
foreach ($arr as $k => $v){
        echo $k . ' — зарплата ' . $v . ' долларов.' . '<br>';
}